lab-ish/reTerminal-weather-dashboard/firmware/sdkconfig.defaults
# ESP32-S3 / reTerminal E1002（PSRAM 8MB, Flash 32MB）
CONFIG_IDF_TARGET="esp32s3"

# Flash 32MB
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="32MB"

# PSRAM（8MB, Octal SPI）— 187.5KB フレームバッファを PSRAM に確保する
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

# カスタムパーティション
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# HTTPS 用証明書バンドル（esp_crt_bundle_attach で github.io を検証）
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# 低消費電力: deep sleep 前提。ログは M8 実機調整で絞る
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
